[{"Job_title":"Data Scientist","Location":"Moorgate, EC2","Salary":"Competitive","Company":"Capita","Post_Date":"Today","Description":"Shape our future as Data Scientist A Data Scientist role is required for Capita's Consulting Business. Devoted to assisting their reputable, blue-chip clients across multiple sectors overcome their information management challenges and unlocking the capability of their data. This is a home-based role requiring flexibility to travel to client sites on occasion. We're supporting our clients as they adapt to a new world in the wake of COVID-19. We're now recruiting for roles which will help our clients to deliver vital services and to resume business wherever possible. We are looking for an individual to be part of our data science team and work on engagements with clients. This includes delivering solutions and working as part of a growing data science team within Capita Consult and Transform.","Image":"https:\/\/www.jobsite.co.uk\/jobs-at\/capita\/jobs","Job_Reference":"https:\/\/www.jobsite.co.uk\/tp-out?urlfragment=%2Fjob%2Fdata-scientist%2Fcapita-job97818127%3FsearchCriteria%3DData%2520Scientist%26searchLocation%3DLondon%26src%3Dsearch%26page%3D1%26position%3D1%26source%3Djobsite%26WT.mc_id%3DA_PT_CrossBrand_Jobsite"},{"Job_title":"Data Scientist","Location":"Acton Green, W4 4AL","Salary":"Competitive Salary","Company":"BSI Group","Post_Date":"Recently","Description":"Great that you're thinking about a career with BSI! Job Title: Data Scientist Location: Hybrid working, Chiswick BSI has shaped best practices for over 100 years, helping organisations around the world embed excellence, build competence and capability for sustainable growth. We have a fantastic opportunity for an ambitious Data Scientist to join ourMarketing Data and Insights team. The successful candidate will report to Data Science Manager and will be working from our West London office on a 2\/3 day per week. This is a new permanent role and a chance to join a growing team looking to transform BSI into an insights-driven organisation where all decisions are underpinned with robust data analysis. The position provides a unique chance to build and implement advanced analytical solutions from scratch.","Image":"https:\/\/www.jobsite.co.uk\/jobs-at\/bsi-group\/jobs","Job_Reference":"https:\/\/www.jobsite.co.uk\/tp-out?urlfragment=%2Fjob%2Fdata-scientist%2Fbsi-group-job97807524%3FsearchCriteria%3DData%2520Scientist%26searchLocation%3DLondon%26src%3Dsearch%26page%3D1%26position%3D2%26source%3Djobsite%26WT.mc_id%3DA_PT_CrossBrand_Jobsite"},{"Job_title":"Data Scientist","Location":"London","Salary":"Competitive","Company":"Bloomberg","Post_Date":"Recently","Description":"Bloomberg's Management Reporting & Analysis' (MR&A) Data Science Solutions Team is entrusted to continually improve the ability to make data-driven decisions for Bloomberg's senior management, Product and Sales teams. Our team arms Sales and other client-facing teams with data to optimise their prospecting and retention efforts. We enable Product teams to build better products by providing them with deep insights into customer behaviour and helping them prototype and develop ML-based products. We also build products utilising usage data to improve our customer's experience. And that's just a sampling of projects from a \"typical\" week! We are looking for an experienced data scientist to join our team. You will work alongside engineers, product managers, sales managers and data scientists from across the organisation to tackle complex business problems.","Image":"https:\/\/www.jobsite.co.uk\/jobs-at\/bloomberg\/jobs","Job_Reference":"https:\/\/www.jobsite.co.uk\/tp-out?urlfragment=%2Fjob%2Fdata-scientist%2Fbloomberg-job97792724%3FsearchCriteria%3DData%2520Scientist%26searchLocation%3DLondon%26src%3Dsearch%26page%3D1%26position%3D3%26source%3Djobsite%26WT.mc_id%3DA_PT_CrossBrand_Jobsite"},{"Job_title":"Data Scientist","Location":"Meadow Green, AL8 6AE","Salary":"£32,673 - 41,718 per year + benefits","Company":"Crooton Ltd","Post_Date":"Posted 5 days ago","Description":"Working for Hertfordshire Police doesnt have to mean patrolling the streets. Were excited to be working for Hertfordshire Police and supporting with their recruitment with a Data Scientist working in the Strategic Hub on a 12-month fixed term contract initially with a view to turning into a permanent role. You will be working at Herts HQ at Welwyn Garden City on an agile basis with a mixture of office based and remote working. The Strategic Hub is a is a new department within the Strategy, Performance & Transformation department, whose remit is to enhance the Constabularys approach to understanding, planning, and managing organisational & operational demands, including the Force Management Statement. The Hub provides a dedicated thinking and learning capability, to successfully influence the organisation.","Image":"https:\/\/www.jobsite.co.uk\/jobs-at\/crooton\/jobs","Job_Reference":"https:\/\/www.jobsite.co.uk\/tp-out?urlfragment=%2Fjob%2Fdata-scientist%2Fcrooton-ltd-job97780458%3FsearchCriteria%3DData%2520Scientist%26searchLocation%3DLondon%26src%3Dsearch%26page%3D1%26position%3D4%26source%3Djobsite%26WT.mc_id%3DA_PT_CrossBrand_Jobsite"},{"Job_title":"Data Scientist","Location":"W9, West London","Salary":"Up to £55,000 per annum Bonus & Excellent Benefits","Company":"Venture Up Ltd","Post_Date":"Expires in 2 days","Description":"Graduate Data Scientist Sports betting - London Job Summary Graduate Data Scientist is required for one of the leading providers of sports betting brokerage software in the world. The successful candidate will be joining the team who is responsible ofnew projects where they like to challenge current solutions with novel and unique thinking. The company isnt tied to any technology or approach; they encourage exploration and discovery as they strive to be at the forefront of tomorrows buzzwords. The team is currently 8 people (in a company of 50), including some of the top talent in Maths, Statistics, Software engineers and Chess. The successful Graduate Data Scientist will work closely with the developers and data analysts as well as the senior management team to oversee the new trading strategies in action.","Image":"https:\/\/www.jobsite.co.uk\/jobs-at\/venture-up\/jobs","Job_Reference":"https:\/\/www.jobsite.co.uk\/tp-out?urlfragment=%2Fjob%2Fdata-scientist%2Fventure-up-ltd-job97779927%3FsearchCriteria%3DData%2520Scientist%26searchLocation%3DLondon%26src%3Dsearch%26page%3D1%26position%3D5%26source%3Djobsite%26WT.mc_id%3DA_PT_CrossBrand_Jobsite"},{"Job_title":"Principal Data Scientist","Location":"City of London, London","Salary":"£90000 - £110000 per annum","Company":"Anonymous","Post_Date":"Posted 5 days ago","Description":"It is a new opportunity to join an established team of Data Engineers, Scientists and Machine Learning Engineers working on building-out their core data product suite and services. You will be responsible for guiding the team on delivery best practices and data architecture developing a CI\/CD platform for a regular release process into a production environment. The role will be ideal for someone looking to be involved in strategic and technical planning, whilst also managing a team of data specialists. * Previous team lead or managerial experience within a Data team * Deep understanding of Machine Learning or Deep Learning * Experience with cloud platforms, infrastructure, and delivery * Masters or PHD Degree in a quantitative subject or a scientific background","Image":"https:\/\/www.jobsite.co.uk\/jobs-at\/reed-technology\/jobs","Job_Reference":"https:\/\/www.jobsite.co.uk\/tp-out?urlfragment=%2Fjob%2Fprincipal-data-scientist%2Fanonymous-job97774006%3FsearchCriteria%3DData%2520Scientist%26searchLocation%3DLondon%26src%3Dsearch%26page%3D1%26position%3D6%26source%3Djobsite%26WT.mc_id%3DA_PT_CrossBrand_Jobsite"},{"Job_title":"Data Engineer - Data Scientist","Location":"Whitechapel, E1 8QS","Salary":"£55k DOE","Company":"Wilmington","Post_Date":"Today","Description":"Wilmington PLC are looking for a Data Engineer - Data Scientist Location: Homebased with some travel to London - E1 8QS Salary: £55k DOE Term: Full time, Permanent Why do we want you? You are an experienced, competent, forward thinking data scientist who loves variety and autonomy and would enjoy the working in a company where data science is in its infancy allowing to utilise your problem solving skills to identify relevant data solutions. You have strong data modelling and SQL\/database design skills, along with strong knowledge of ETL processes and exceptional programming skills - specifically those used in the application of data science, e.g. SQL, R, Python, JavaScript etc.","Image":"https:\/\/www.jobsite.co.uk\/jobs-at\/wilmington\/jobs","Job_Reference":"https:\/\/www.jobsite.co.uk\/tp-out?urlfragment=%2Fjob%2Fdata-engineer-data-scientist%2Fwilmington-job97817412%3FsearchCriteria%3DData%2520Scientist%26searchLocation%3DLondon%26src%3Dsearch%26page%3D1%26position%3D7%26source%3Djobsite%26WT.mc_id%3DA_PT_CrossBrand_Jobsite"},{"Job_title":"Data Scientist","Location":"London","Salary":"Up to £65,000 per annum","Company":"IGA Talent Solutions","Post_Date":"Posted 6 days ago","Description":"I am working with a fantastic customer, who are looking to bring in a Network Data Scientist to the team on a permanent basis. You will be working on the Network Data Science and Software Team. You will be working on a team responsible for taking a data-driven approach towards meeting network planning goals, including capacity planning, performance planning and network economics. Key Skills Telecommunications industry experience (or similar, e.g. academia).BSc \/ MSc in Computer Science, Electrical Engineering or similar. Strong programming skills (ideally in Python). SQL knowledge. Strong analytical skills and a consultative, proactive and join-the-dots approach. If this role sounds like it could be of interest, please apply!","Image":"https:\/\/www.jobsite.co.uk\/jobs-at\/iga-talent-solutions\/jobs","Job_Reference":"https:\/\/www.jobsite.co.uk\/tp-out?urlfragment=%2Fjob%2Fdata-scientist%2Figa-talent-solutions-job97768674%3FsearchCriteria%3DData%2520Scientist%26searchLocation%3DLondon%26src%3Dsearch%26page%3D1%26position%3D8%26source%3Djobsite%26WT.mc_id%3DA_PT_CrossBrand_Jobsite"},{"Job_title":"Sr. Data Scientist - Ads Traffic Quality","Location":"London","Salary":"Negotiable","Company":"People Source Consulting Limited","Post_Date":"Expires in 1 day","Description":"┃ Top 5 Global Tech Company┃ Competitive Salary * Sign-on bonus * Relocation package\/potential for WFH * Company stocks * New and expanding team People Source Consulting is currently exclusively partnered with a top 5 global tech company, looking to recruit a Senior Data Scientist to join their brand-new initiative for their contextual advertising product. As an ideal candidate, you will be an experienced user of sophisticated analytical techniques, with a dynamic, and innovative approach to contextual data processing. As this is a new initiative, you will have the opportunity to act as a thought-leader, working backward from the customer's needs to map out and conceptualize algorithms, all whilst collaborating with multi-functional teams.","Image":"https:\/\/www.jobsite.co.uk\/jobs-at\/people-source-consulting\/jobs","Job_Reference":"https:\/\/www.jobsite.co.uk\/tp-out?urlfragment=%2Fjob%2Fsr-data-scientist-ads-traffic-quality%2Fpeople-source-consulting-limited-job97768679%3FsearchCriteria%3DData%2520Scientist%26searchLocation%3DLondon%26src%3Dsearch%26page%3D1%26position%3D9%26source%3Djobsite%26WT.mc_id%3DA_PT_CrossBrand_Jobsite"},{"Job_title":"Data Scientist - Contextual Ads","Location":"London","Salary":"Negotiable","Company":"People Source Consulting Limited","Post_Date":"Expires in 1 day","Description":"┃ Top 5 Global Tech Company┃ Competitive Salary * Sign-on bonus * Relocation package\/potential for WFH * Company stocks * New and expanding team People Source Consulting is currently exclusively partnered with a top 5 global tech company, looking to recruit a Data Scientist to join their brand-new initiative for their contextual advertising product. As an ideal candidate, you will be an experienced user of sophisticated analytical techniques, with a dynamic, and innovative approach to contextual data processing. As this is a new initiative, you will have the opportunity to act as a thought-leader, working backward from the customer's needs to map out and conceptualize algorithms, all whilst collaborating with multi-functional teams.","Image":"https:\/\/www.jobsite.co.uk\/jobs-at\/people-source-consulting\/jobs","Job_Reference":"https:\/\/www.jobsite.co.uk\/tp-out?urlfragment=%2Fjob%2Fdata-scientist-contextual-ads%2Fpeople-source-consulting-limited-job97768309%3FsearchCriteria%3DData%2520Scientist%26searchLocation%3DLondon%26src%3Dsearch%26page%3D1%26position%3D10%26source%3Djobsite%26WT.mc_id%3DA_PT_CrossBrand_Jobsite"},{"Job_title":"Data Scientist","Location":"London","Salary":"£70000 - £80000 per annum + 38 days holiday (inc. bank holidays)","Company":"In Technology Group Limited","Post_Date":"Expires in 1 day","Description":"Fully Remote £80K This is a very hands-on position. We are looking for someone to not only assist with the design of our clients' market-leading software but to also get hands-on and implement it too. If you do not have the 'design \/ architectural' experience, you will be upskilled personally by the Lead Architect, so this is an excellent opportunity for someone looking to progress further from a purely engineering role. This role will suit a very technical Machine Learning Engineer with a start-up mentality who is happy to work autonomously as well as part of a close-knit team of techies. The company are an award-winning SaaS business, just 3 years into their journey. Their culture is focused around flexible working and ensuring that every member of the team is making a genuine and rewarding difference to the output of the business. They want everyone to feel valued.","Image":"https:\/\/www.jobsite.co.uk\/jobs-at\/in-technology-group\/jobs","Job_Reference":"https:\/\/www.jobsite.co.uk\/tp-out?urlfragment=%2Fjob%2Fdata-scientist%2Fin-technology-group-limited-job97761740%3FsearchCriteria%3DData%2520Scientist%26searchLocation%3DLondon%26src%3Dsearch%26page%3D1%26position%3D11%26source%3Djobsite%26WT.mc_id%3DA_PT_CrossBrand_Jobsite"},{"Job_title":"Principal Data Scientist","Location":"London","Salary":"£80000 - £100000 per annum + Remote\/WFH","Company":"In Technology Group Limited","Post_Date":"Expires in 1 day","Description":"£100K Fully Remote Working This company are a global leader in their area of software. They are offering an attractive package for a strong Data Scientist to join and transform their existing R&D NLP team. Their existing team is experienced but we are looking for someone to fully focus on the transformation from traditional NLP technologies to deep learning transducer-based approaches. You will have full autonomy in your position and your input will be imperative in the determination of the technologies best suited to achieve the business goals. You will also be responsible for defining scientific direction and advising other employees regarding work across the R&D pipeline. ** Classical and Deep Learning NLP techniques ** Developing working NLP systems ** Deep Learning Transducer Technologies ** Pre-trained Transducer Models (e.g. Bert & GPT-2\/3)","Image":"https:\/\/www.jobsite.co.uk\/jobs-at\/in-technology-group\/jobs","Job_Reference":"https:\/\/www.jobsite.co.uk\/tp-out?urlfragment=%2Fjob%2Fprincipal-data-scientist%2Fin-technology-group-limited-job97760082%3FsearchCriteria%3DData%2520Scientist%26searchLocation%3DLondon%26src%3Dsearch%26page%3D1%26position%3D12%26source%3Djobsite%26WT.mc_id%3DA_PT_CrossBrand_Jobsite"},{"Job_title":"Data Scientist","Location":"City of London, London","Salary":"£26000 - £32000 per annum + Benefits","Company":"In Technology Group Limited","Post_Date":"Expires today","Description":"My client is a UK consultancy that offers a unique and top-quality service. Their work focuses on providing support and investing in solutions for the benefit of their people and the society they are part of. They are currently looking for an ambitious Data Scientist to join their dedicated Actuarial Tools Team. Duties and Responsibilities * Assist and support the workflow and project management * Identify any technical issues and implement viable solutions * Guiding team members and training them on new systems and tools * Liaising with internal and external stakeholders Skills and Experience * Strong customer service understanding * Understanding of actuarial maths and IT * High level of coding skills with an analytical mindset (Python) * Strong organisation and prioritisation skills * Strong written and verbal communication * Microsoft Excel proficiency","Image":"https:\/\/www.jobsite.co.uk\/jobs-at\/in-technology-group\/jobs","Job_Reference":"https:\/\/www.jobsite.co.uk\/tp-out?urlfragment=%2Fjob%2Fdata-scientist%2Fin-technology-group-limited-job97757743%3FsearchCriteria%3DData%2520Scientist%26searchLocation%3DLondon%26src%3Dsearch%26page%3D1%26position%3D13%26source%3Djobsite%26WT.mc_id%3DA_PT_CrossBrand_Jobsite"},{"Job_title":"Data Scientist Consultant - AI \/ ML","Location":"London","Salary":"£60000 - £100000 per annum + plus bens","Company":"Ecs Resource Group Ltd","Post_Date":"Posted 7 days ago","Description":"Data Scientist Consultant - Artificial Intelligence \/ Machine Learning Permanent role £60K - £100K including bonus, plus benefits Multiple roles varying in seniority Remote working but travel to client sites will be required As Data Scientist Consultant, you will support the Applied Artificial Intelligence Advisory division leveraging modern AI\/ML, cognitive and data science-based techniques to manage data, predict scenarios and prescribe actions. *Architect, Position, Design, Develop and Deploy enterprise solutions which include components across the Artificial Intelligence spectrum such as Machine Learning, Deep-Learning, Virtual Assistants and Cognitive Services (e.g., Vision\/Image, Textual\/Language processing). Deep expertise is needed on at least one of the components.","Image":"https:\/\/www.jobsite.co.uk\/jobs-at\/the-ecs-recruitment-group\/jobs","Job_Reference":"https:\/\/www.jobsite.co.uk\/tp-out?urlfragment=%2Fjob%2Fdata-scientist-consultant-ai-ml%2Fecs-resource-group-ltd-job97748421%3FsearchCriteria%3DData%2520Scientist%26searchLocation%3DLondon%26src%3Dsearch%26page%3D1%26position%3D14%26source%3Djobsite%26WT.mc_id%3DA_PT_CrossBrand_Jobsite"},{"Job_title":"Lead Data Scientist - Woking\/Hybrid","Location":"Woking, Surrey, GU21 1sb","Salary":"£50000 - £95000 per annum","Company":"IN4 Talent","Post_Date":"Posted 4 days ago","Description":"Lead Data Scientist- Hybrid (Woking) £50,000 - £95,000 Our client is a prominent technology and engineering company supporting National Security, Defence, and Public\/Private sector, working on some of the most advanced technology projects around. With more than 600+ employees UK-wide and looking to increase that due to a phenomenal period of growth. As a Lead Data Scientist, you will work on innovative Data solutions and ground-breaking projects that have real-world and life-altering applications. If you want to work on the cutting edge of technological advancement with a company that has passion drive, purpose, and an understanding that technology is not just for profit, this is the company for you.","Image":"https:\/\/www.jobsite.co.uk\/jobs-at\/in4-talent\/jobs","Job_Reference":"https:\/\/www.jobsite.co.uk\/tp-out?urlfragment=%2Fjob%2Flead-data-scientist-woking-hybrid%2Fin4-talent-job97790462%3FsearchCriteria%3DData%2520Scientist%26searchLocation%3DLondon%26src%3Dsearch%26page%3D1%26position%3D15%26source%3Djobsite%26WT.mc_id%3DA_PT_CrossBrand_Jobsite"},{"Job_title":"Data Analyst \/ Scientist","Location":"London","Salary":"£50000 - £55000 per annum","Company":"Senitor Associates Limited","Post_Date":"Posted 3 days ago","Description":"My client is looking for a highly skilled Data Analyst \/ Scientist, with a strong financial services background, to join their Data Analytics team in supporting the company's Internal Audit Team. The company is offering hybrid working from their central London office, that is located within walking distance from Canary Wharf tube and train station. The company are a global professional services company that specialises in human capital, audit, tax and technology services for many firms located all over the world. After being founded over 30 years ago, they have grown to have over 300,000 employees worldwide and continue to develop and grow every year! The Internal Audit team provides confidence to the company's clients and stakeholders, and your role will be to support this through data analytics, data management, AI and Robotic Process Automation.","Image":"https:\/\/www.jobsite.co.uk\/jobs-at\/senitor-associates\/jobs","Job_Reference":"https:\/\/www.jobsite.co.uk\/tp-out?urlfragment=%2Fjob%2Fdata-analyst-scientist%2Fsenitor-associates-limited-job97808565%3FsearchCriteria%3DData%2520Scientist%26searchLocation%3DLondon%26src%3Dsearch%26page%3D1%26position%3D16%26source%3Djobsite%26WT.mc_id%3DA_PT_CrossBrand_Jobsite"},{"Job_title":"Data Scientist, Ads Analytics","Location":"TW9, Richmond, TW9 1EJ","Salary":"Competitive + Benefits","Company":"eBay","Post_Date":"Recently","Description":"Looking for a company that inspires passion, courage and creativity, where you can be on the team shaping the future of global commerce? Want to shape how millions of people buy, sell, connect, and share around the world? If you're interested in joining a purpose driven community that is dedicated to crafting an ambitious and inclusive work environment, join eBay - a company you can be proud to be with. We are looking to hire a Data Scientist to partner closely with the eBay Advertising product team. As a critical member of the Advertising Product Insights team, this role will have the unique opportunity to influence decision making of the Ads Product roadmap with their insights and thought leadership.","Image":"https:\/\/www.jobsite.co.uk\/jobs-at\/ebay\/jobs","Job_Reference":"https:\/\/www.jobsite.co.uk\/tp-out?urlfragment=%2Fjob%2Fdata-scientist-ads-analytics%2Febay-job97740743%3FsearchCriteria%3DData%2520Scientist%26searchLocation%3DLondon%26src%3Dsearch%26page%3D1%26position%3D17%26source%3Djobsite%26WT.mc_id%3DA_PT_CrossBrand_Jobsite"},{"Job_title":"Apple Growth Marketing- Data Scientist","Location":"London","Salary":"Unspecified","Company":"Apple","Post_Date":"Posted 3 days ago","Description":"Summary Weekly Hours: 35 Role Number:200342372 Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. You bring passion and dedication to your job and there's no telling what you could accomplish! Apple is in search of an experienced Digital Media Data Scientist to join the Apple Services Digital Marketing team in Culver City, California to help improve our marketing strategies for Apple Media Services. As a Data Scientist you will develop compelling and actionable metrics through quantitative analysis, analytics engineering and innovative thinking. You are interested in the future of media services including Music, Video, Gaming, etc.","Image":"https:\/\/www.jobsite.co.uk\/jobs-at\/apple\/jobs","Job_Reference":"https:\/\/www.jobsite.co.uk\/tp-out?urlfragment=%2Fjob%2Fapple-growth-marketing-data-scientist%2Fapple-job97800464%3FsearchCriteria%3DData%2520Scientist%26searchLocation%3DLondon%26src%3Dsearch%26page%3D1%26position%3D18%26source%3Djobsite%26WT.mc_id%3DA_PT_CrossBrand_Jobsite"},{"Job_title":"Data Scientist \/ Engineer","Location":"London","Salary":"£50000 - £60000 per annum + REMOTE WORK, BONUS","Company":"ITECCO Limited","Post_Date":"Expires in 3 days","Description":"ROLE: Data Scientist \/ Engineer SALARY: £50,000 - £60,000 LOCATION: Remote We are looking for a highly talented individual to join one of the biggest IT Services and IT Consulting firms, operating out of both N. America and Europe. It is their innovative software, and solutions that empower companies to achieve cutting edge results from their risk, insurance, and claims programs. Through their software solutions, global capabilities, and domain expertise, they're the proven leader in supporting virtually every type of industry and the largest and most complex companies in the world. They are now looking for a Data Scientist \/ Engineer or a candidate that's a blend of the two, to join their rapidly growing team. They have offices based all over the world so are happy for a candidate to work remotely in the UK or out of their modern offices in London.","Image":"https:\/\/www.jobsite.co.uk\/jobs-at\/itecco\/jobs","Job_Reference":"https:\/\/www.jobsite.co.uk\/tp-out?urlfragment=%2Fjob%2Fdata-scientist-engineer%2Fitecco-limited-job97797053%3FsearchCriteria%3DData%2520Scientist%26searchLocation%3DLondon%26src%3Dsearch%26page%3D1%26position%3D19%26source%3Djobsite%26WT.mc_id%3DA_PT_CrossBrand_Jobsite"},{"Job_title":"Data Scientist (MI Lead)","Location":"The City, EC2R 8AH","Salary":"From £45,900 to £49,000 per annum","Company":"Bank of England","Post_Date":"Recently","Description":"The Bank of England is the UK's central bank. Our mission is to deliver monetary and financial stability for the British people. The Bank of England is a diverse organisation. Each of its5,000 people are committed to public service and dedicated to promoting the good of the people of the United Kingdom by maintaining monetary and financial stability. Job Description This is a really exciting opportunity to be part of a high-profile team at the heart our strategic priority to build a diverse and inclusive Bank. As a Data Scientist, you will be at the forefront of how we use data to inform recommendations and measure actions to achieve that strategic aim. While the role sits in The Culture, Diversity & Inclusion Division (CDI), you will have direct links to the wider Data community to help support your professional development.","Image":"https:\/\/www.jobsite.co.uk\/jobs-at\/bank-of-england\/jobs","Job_Reference":"https:\/\/www.jobsite.co.uk\/tp-out?urlfragment=%2Fjob%2Fdata-scientist-mi-lead%2Fbank-of-england-job97731272%3FsearchCriteria%3DData%2520Scientist%26searchLocation%3DLondon%26src%3Dsearch%26page%3D1%26position%3D20%26source%3Djobsite%26WT.mc_id%3DA_PT_CrossBrand_Jobsite"},{"Job_title":"Data Scientist","Location":"SE1, South East London, SE1 0SW","Salary":"Competitive Salary + Benefits","Company":"Omnicom","Post_Date":"Recently","Description":"About the Role We are seeking Senior Manager of Data Science to help modernise a fledgling data science team, blending a mix of machine learning excellence with stakeholder management skills. Data science has been a fixture at OMD for a number of years, working on a diverse set of projects from building high revenue data platforms to performing one off analytics. As we enter a new data landscape within digital media, we are building out a new set of products to meet the changing needs of our clients. This is an exciting opportunity to make a positive impact on a team who are excited to try new things. Data Science and Marketing Science co-manage a team of 10 data scientists and marketing scientists.","Image":"https:\/\/www.jobsite.co.uk\/jobs-at\/omnicom\/jobs","Job_Reference":"https:\/\/www.jobsite.co.uk\/tp-out?urlfragment=%2Fjob%2Fdata-scientist%2Fomnicom-job97697880%3FsearchCriteria%3DData%2520Scientist%26searchLocation%3DLondon%26src%3Dsearch%26page%3D1%26position%3D21%26source%3Djobsite%26WT.mc_id%3DA_PT_CrossBrand_Jobsite"},{"Job_title":"NLP Data Scientist - Python SQL","Location":"Southwark, SE1","Salary":"£65000 - £80000 per annum + benefits + stock options","Company":"Data Team","Post_Date":"Posted 17 days ago","Description":"NLP Data Scientist London to £80k Do you have a passion for building scalable and efficient data science products? Do you want to be part of a fast-paced, start-up environment where you can enjoy a generous benefits scheme including 30 days holiday (on top of bank holidays) and the option to work remotely up to 4 days a week? You could be joining a hugely successful, leading alternative data company that delivers consumer spend data and analytics products to clients globally. As an NLP Data Scientist, you will join the growing Data and Technology team where you will be responsible for analysing and developing NLP models for text classification to tag consumer transaction data.","Image":"https:\/\/www.jobsite.co.uk\/jobs-at\/database-team\/jobs","Job_Reference":"https:\/\/www.jobsite.co.uk\/tp-out?urlfragment=%2Fjob%2Fnlp-scientist%2Fdata-team-job97671115%3FsearchCriteria%3DData%2520Scientist%26searchLocation%3DLondon%26src%3Dsearch%26page%3D1%26position%3D22%26source%3Djobsite%26WT.mc_id%3DA_PT_CrossBrand_Jobsite"},{"Job_title":"Junior Data Scientist","Location":"Acton Park, W3 6RS","Salary":"To define","Company":"Currys","Post_Date":"Recently","Description":"We are Currys. One team with one big passion. Technology. We sell it, we deliver it, we install it, we support it, we fix it. And, most important of all, we bring a human touch to tech to make the magic happen! As the UKs best-known retailer in tech, we are very proud of the service levels we provide for our customers. Online, in-store or in their homes, we go the extra mile. And its all down to our people, 30,000+ capable and committed colleagues, learning together, growing together, making us amazing and celebrating the wins together. London, Hybrid The Currys Data Science and Analytics team is a team that delivers insight for driving business decisions. Our analysis and recommendations impact revenue, costs, margin and experience of store colleagues and customers that visit our stores and websites every day.","Image":"https:\/\/www.jobsite.co.uk\/jobs-at\/carphone-warehouse\/jobs","Job_Reference":"https:\/\/www.jobsite.co.uk\/tp-out?urlfragment=%2Fjob%2Fjunior-data-scientist%2Fcurrys-job97797430%3FsearchCriteria%3DData%2520Scientist%26searchLocation%3DLondon%26src%3Dsearch%26page%3D1%26position%3D23%26source%3Djobsite%26WT.mc_id%3DA_PT_CrossBrand_Jobsite"},{"Job_title":"Data Scientist","Location":"W1, Central London, W1D 6AP","Salary":"Competitive Salary + Benefits","Company":"MARS","Post_Date":"Posted 19 days ago","Description":"It's undeniable: Pets truly make the world a better place. That's why we're inspired to make A Better World For Pets™, a world where they're healthy, happy and welcome. It's safe to say, at Mars Petcare, we're passionate about pets, and their health. To deliver on this ambition of being Powered by Data strategy we need talent with expertise and experience of data science and advanced analytics to deliver multiple initiatives and join the change in data and pet- and pet-centric thinking across the entire Mars Petcare business. The purpose of this role is to join and be an integral part of the expanding data science function and to deliver the Powered By Data project across Mars Petcare divisions using the ecosystem of data available.","Image":"https:\/\/www.jobsite.co.uk\/jobs-at\/mars\/jobs","Job_Reference":"https:\/\/www.jobsite.co.uk\/tp-out?urlfragment=%2Fjob%2Fdata-scientist%2Fmars-job97648268%3FsearchCriteria%3DData%2520Scientist%26searchLocation%3DLondon%26src%3Dsearch%26page%3D1%26position%3D24%26source%3Djobsite%26WT.mc_id%3DA_PT_CrossBrand_Jobsite"},{"Job_title":"Data Scientist","Location":"Pentonville, N1","Salary":"Competitive","Company":"Datatech Analytics","Post_Date":"Recently","Description":"J12212 Data Scientist - London\/hybrid working - Up To £45,000 The World's leading media agency network has an exciting new opportunity for a Data Scientist. In this role you will identify opportunities to apply data science that will benefit the clients, research to find the most appropriate data science algorithms for a project, implement the algorithm, and help engineer a delivery mechanism so that everyone can exploit your work. Working within a team of Data Scientists, Engineers, and Developers, you will be helping to develop solutions to some of the biggest challenges in the industry from measuring media in a post 3rd party cookie world, to optimising multimillion-pound media budgets, and targeting audiences effectively. Responsibilities Work with the UK and Global Annalect teams on new and innovative data driven solutions","Image":"https:\/\/www.jobsite.co.uk\/jobs-at\/datatech-analytics\/jobs","Job_Reference":"https:\/\/www.jobsite.co.uk\/tp-out?urlfragment=%2Fjob%2Fdata-scientist%2Fdatatech-analytics-job97644178%3FsearchCriteria%3DData%2520Scientist%26searchLocation%3DLondon%26src%3Dsearch%26page%3D1%26position%3D25%26source%3Djobsite%26WT.mc_id%3DA_PT_CrossBrand_Jobsite"}]